Repository: ewancoder/modem-manager
Catalog: locale/*/LC_MESSAGES/features.po
Languages: ru

source: Features
ru: Возможности

source: Functionality
ru: Функциональность

source: Stable response from modem
ru: Стабильная связь с модемом

source: Query all information about embedded module
ru: Полная информация о модеме

source: General information
ru: Общая информация

source: Memory sizes
ru: Информация о памяти

source: Firmware information
ru: Информация о прошивке

source: Queue of commands
ru: Очередь команд

source: All commands added to one queue executed in the background thread
ru: Все команды добавляются в общую очередь, работающую в фоне

source: User can pause and resume commands, added to the queue
ru: Пользователи могут приостанавливать и продолжать команды, добавленные в очередь

source: Queue can be automatically stopped when an error occur (if configured)
ru: Очередь может автоматически останавливаться при возникновении ошибок (если настроено)

source: There is a list of current commands in the queue. Currently running command is highlighted
ru: Список текущих команд очереди отображается на экране. Текущая команда подсвечивается другим цветом

source: When started automatic modem configuration, queue tab can be automatically selected (if not disabled)
ru: При запуске автоматической настройки модема, вкладка очереди автоматически открывается для просмотра

source: Uploading firmware, using XModem protocol
ru: Загрузка прошивки, используя XModem-протокол

source: Automatic modem configuration
ru: Автоматическая конфигурация модема

source: Erase application
ru: Стереть приложение

source: Write bootloader and firmware
ru: Запись загрузчика и прошивки

source: Remap memory
ru: Разбивка памяти

source: Choose both AD and FS sizes, then let automatic mapper do the work for you
ru: Выбор разделов приложения и файловой системы, автоматическая разбивка после

source: Minimal size of AD aread is 256 KiB (for safety)
ru: Минимальный размер раздела памяти под приложение составляет 256 КиБ (для защиты)

source: Visual view of mapped areas
ru: Визуальное отображение распределённой памяти

source: Write application
ru: Запись приложения

source: Prepare modem for remote firmware writing
ru: Подготовка модема к удалённой прошивке

source: Sync time
ru: Синхронизация времени

source: Usability
ru: Удобство

source: Command autocompletion and suggestion based on input history
ru: Автодополнение команд с всплывающим списком истории

source: Localization of every UI element as well as status messages
ru: Локализация всех графических элементов, статус-сообщений и т. п.

source: Remember all configured settings per sessions
ru: Сохранение всех настроек между сессиями

source: Visuals
ru: Визуальный стиль

source: Clean and filtered **Console window**
ru: Чистое и фильтрованное **окно консоли**

source: Command timespan
ru: Дата выполнения команды

source: Colorful statuses in console
ru: Цветные статусы в консоли

source: Raw serial **Monitor window**
ru: Низкоуровневое **окно COM-монитора**

source: Keep all history until another port is used
ru: Содержит всю историю команд пока порт открыт

source: Search through both console windows
ru: Поиск по обоим консольным окнам

source: Colorful and noticeable status boxes
ru: Цветные и заметные статус-индикаторы

source: Flexible layout - windows are totally resizeable to any screen resolution, in-form splits are totally movable whenever you want. Also, you can show/hide information/console view (F11/F12)
ru: Гибкий дизайн - окна полностью растягиваемы и сжимаемы, совместимы с любыми разрешениями экранов, внутренние разделители позволяют раздвигать элементы для большей гибкости. Также, можно показать/скрыть некоторые окна горячими клавишами (F11/F12).

source: Progressbar shows file uploading
ru: Индикатор прогресса показывает процесс загрузки файла

source: Keyboard shortcuts
ru: Горячие клавиши

source: Global:
ru: Общие:

source: :s:`Ctrl` + :s:`L` - Clear console
ru: :s:`Ctrl` + :s:`L` - Очистить консоль

source: Command input field:
ru: Ввод AT-команд:

source: :s:`Return` - Send command
ru: :s:`Return` - Послать команду

source: :s:`Ctrl` + :s:`Z` - Send data in download mode (substitute character at the end)
ru: :s:`Ctrl` + :s:`Z` - Послать данные для загрузки (символ substutite в конце строки)

source: Window focus:
ru: Навигация внутри окна:

source: :s:`Ctrl` + :s:`F` - Focus search field
ru: :s:`Ctrl` + :s:`F` - Перейти на поле поиска

source: Development
ru: Разработка

source: Clean code base and architecture
ru: Чистая кодовая база и архитектура

source: Minimal dependencies
ru: Минимальные зависимости

source: Threading: all the work done in the background thread, UI does not freeze
ru: Мультипоточность: вся работа совершается в фоне, графический интерфейс не тормозит

source: Separate classes do separate work
ru: Разные классы делают распределённую работу

source: Constructive comments for most code blocks
ru: Конструктивные комментарии для большинства блоков кода

source: Code enclosed in #regions for clarity
ru: Части кода закрыты в блоках региона #regions для удобства

source: :s:`Alt` + :s:`1` - switch to 1st **Connection** tab
ru: :s:`Alt` + :s:`1` - переключиться на 1ую вкладку **Соединение**

source: :s:`Alt` + :s:`2` - switch to 2nd **Queue** tab
ru: :s:`Alt` + :s:`2` - переключиться на 2ую вкладку **Очередь**

source: :s:`Alt` + :s:`3` - switch to 3rd **Settings** tab
ru: :s:`Alt` + :s:`3` - переключиться на 3ю вкладку **Настройки**

source: :s:`Alt` + :s:`4` - switch to 4th **Information** tab
ru: :s:`Alt` + :s:`4` - переключиться на 4ую вкладку **Информация**

source: :s:`Alt` + :s:`5` - switch to 5th **Automatic** tab
ru: :s:`Alt` + :s:`5` - переключиться на 5ую вкладку **Автоматический режим**

source: :s:`Alt` + :s:`6` - switch to 6th **Configuration** tab
ru: :s:`Alt` + :s:`6` - переключиться на 6ую вкладку **Конфигурация**

source: :s:`F1` - PDF documentation will be opened if present, otherwise the website will be shown
ru: :s:`F1` - PDF документация (при наличии), иначе - вебсайт

source: :s:`Ctrl` + :s:`F1` - Show Machine ID: needed for license check (full version unlock)
ru: :s:`Ctrl` + :s:`F1` - Прочитать ID текущей машины (ПК): необходимо для проверки лицензии (разблокировки полной версии)

source: :s:`F5` - Update (fill) modem information
ru: :s:`F5` - Обновить (прочитать) информацию о модеме

source: :s:`F6` - Update (fill) modem configuration
ru: :s:`F6` - Обновить (прочитать) конфигурацию приложения

source: :s:`F9` - Store current modem in XML database of installed modems
ru: :s:`F9` - Записать текущие настройки модема в XML-базу установленных модемов

source: :s:`F11` - Hide / show **Console** view
ru: :s:`F11` - Скрыть / показать **Консольное** окно

source: :s:`F12` - Hide / show **Main** view
ru: :s:`F12` - Скрыть / показать **Главное** окно

source: :s:`Ctrl` + :s:`S` - Save all settings, includes current APN configuration
ru: :s:`Ctrl` + :s:`S` - Сохранить все настройки, включая текущую APN-конфигурацию

source: :s:`Ctrl` + :s:`M` - RAW console mode (full screen COM monitor), could be used with Detach mode (right click -> Detach)
ru: :s:`Ctrl` + :s:`M` - режим полноэкранного монитора COM-порта, может быть совмещён с режимом Отделения окна (ПКМ -> Вынести в отдельное окно)

source: :s:`Ctrl` + :s:`Space` - Pause/Resume queue
ru: :s:`Ctrl` + :s:`Space` - Приостановить/Возобновить очередь

source: :s:`Ctrl` + :s:`I` - Focus AT command input field
ru: :s:`Ctrl` + :s:`I` - Переключиться на поле ввода AT-команд

source: For switching tabs you can use :s:`Ctrl` as well.
ru: Для переключения вкладок также можно использовать клавишу :s:`Ctrl`
