Repository: ewancoder/modem-manager
Catalog: locale/*/LC_MESSAGES/usage.po
Languages: ru

source: Configure start address for COIL registers in modbus device #1. Quantity pf COILS is stored in *Bit Registers number* option
ru: Настройка стартового адреса для регистров COIL в Modbus-устройстве #1

source: Holding Read Address and Size
ru: Адрес и размер чтения [Holding]

source: Block 1 .. 5
ru: Блоки 1 .. 5

source: Rows describes parameters for 5 modbus requests for periodic polling of HOLDING registers.
ru: Строки описывают параметры для 5 Modbus-запросов периодически опрашивающих HOLDING-регистры

source: Device Address
ru: Адрес устройства

source: Setups modbus network device address.
ru: Настраивает сетевой адрес Modbus-устройства

source: Start Address
ru: Стартовый адрес

source: Setups Start HOLDING register in data block.
ru: Настраивает стартовый HOLDING-регистр в блоке данных

source: Size
ru: Размер

source: Setups Holding registers quantity. If 0 - this request will be ignored.
ru: Настраивает количество Holding-регистров. Если 0 - запрос будет проигнорирован.

source: Configure Analog Inputs
ru: Конфигурация аналоговых входов

source: Analog (WORD) register index number.
ru: Номер индекса аналогового (WORD, 16-bit) регистра.

source: Upper limit
ru: Верхний предел

source: Event generation control value. If current and previous register values difference will be more than this limit, event will be generated. Using for detecting unexpected fast changes of register value. Default value is 1.
ru: Событие регистрации контроллируемой величины. Если разница между текущим и предыдущим зарегистрированными значенями будет больше, чем этот предел, событие будет зарегистрировано. Используется для определения неожиданных быстрых изменений регистрируемой величины. Стандартное значение - 1.

source: Lower limit
ru: Нижний предел

source: Event generation control value. If current and previous register values difference will be less, than this limit, even if Time event occurs, event will not be generated. Using for noise reduction. Default value is 0.
ru: Событие регистрации контроллируемой величины. Если разница между текущим и предыдущим зарегистрированными значенями будет меньше, чем этот предел, событие будет зарегистрировано. Используется для снижения шумов. Стандартное значение - 1.

source: Event generation control value. Time out from last generated event. If it expires, new event will be generated. Default value is 60 seconds.
ru: Собитие регистрации сонтроллируемой величины. Таймаут с последнего зарегистрированного события. Если таймаут истекает, новое событие будет зарегистрировано. Стандартное значение - 60 секунд.

source: Configure Digital Inputs
ru: Конфигурация цифровых входов

source: Bit (BIT) register index number.
ru: Номер индекса битового (БИТ) регистра

source: Event generation control value. Time out from last generated event. If it expires, new event will be generated.
ru: Событие регистрации контроллируемой величины. Таймаут с последнего зарегистрированного события. Если таймаут истекает, новое событие будет зарегистрировано.

source: Troubleshooting
ru: Проблемы и их решение

source: Error occurs when trying updating from cloud
ru: При попытке обновления из облака возникает ошибка

source: If error occurred before ``at+wdss=1,1`` command is executed, it most likely happened because you have no SIM card installed. Please, check that you have SIM card installed and that your modem have reliable internet connection (correct APN is set).
ru: Если ошибка возникает перед командой ``at+wdss=1,1``, скорее всего в модеме отсутствует sim-карта. Пожалуйста, проверьте наличие и работоспособность sim-карты, а также надёжное интернет-соединение (правильный APN).

source: Also, make sure that your modem is patched (see :ref:`preparation`). You should click "Prepare empty modem" at least once per each new modem.
ru: Помните также о том, что для корректной работы модем должен быть пропатчен (см. :ref:`preparation`). APN должен быть настроен как минимум 1 раз.

source: Program stopped working and port has disappeared
ru: Программа перестала работать и порт исчез

source: This is presumably Sierra Wireless USB driver problem. You will most likely need to reboot your PC to be able to see port again.
ru: Это, предположительно, проблема драйвера Sierra Wireless USB driver. Скорее всего, вам понадобится перезагрузить компьютер для того чтобы порт снова появился в системе.

source: If this error happened when you already set up configuration in the **"Configuration"** tab, you can simply save whole configuration into XML file, restart application and load this configuration from XML file.
ru: Если проблема возникла во время конфигурации (вкладка **"Конфигурация"**), Вы можете сохранить текущую конфигурацию в XML файл, перезапустить программу и загрузить конфигурацию из XML файла.
