Repository: ewancoder/modem-manager
Catalog: locale/*/LC_MESSAGES/usage.po
Languages: ru

source: User guide
ru: Руководство пользователя

source: Contents
ru: Содержание

source: Starting communication
ru: Установка соединения

source: When you first open the program, you will see the main window.
ru: Когда Вы первый раз откроете программу, Вы увидите следующее окно.

source: At start, all ports available within OS should be updated and filled in ports list :i:`1`. You can manually refresh them after inserting new devices by clicking **"Rescan"** :i:`2` button.
ru: При запуске, все доступные в системе порты обновляются и добавляются в список портов :i:`1`. Вы можете вручную обновить список доступных портов, после добавления новых устройств, нажатием кнопки **"Открыть порт"** :i:`2`.

source: After choosing needed port, select (or input manually) serial port speed (baud rate) for given device :i:`3`. Check or uncheck **"Fill automatically"** :i:`4` checkbox: if it is checked, all information about modem will be filled automatically after you have connected to modem. You can also fill information manually using **"Fill information"** :i:`5` button. The same result could be achieved by using :s:`F5` key (refresh information, see :ref:`key-shortcuts`).
ru: После выбора необходимого порта, выберите (или введите) необходимую скорость передачи данных (baud rate) для выбранного устройства :i:`3`. Установите флажок **"Заполнить автоматически"** :i:`4` если Вы хотите чтобы программа заполнила информацию о модеме автоматически при подключении к устройству. Также в любой момент можно сделать это вручную используя кнопку **"Заполнить информацию"** :i:`5`. Тот же результат может быть получен нажатием горячей клавиши :s:`F5` (обновить информацию, см. :ref:`key-shortcuts`).

source: Click **"Open port"** :i:`6` button to start communication. If port has been successfully opened, status indicator :i:`7` will turn green. This status indicator could be 3 different colors: red for closed, green for opened, blue for *"downloading mode"*.
ru: Для подключения к модему нажмите кнопку **"Открыть порт"** :i:`6`. Если порт был успешно открыт, индикатор текущего статуса :i:`7` станет зелёным. Индикатор статуса может быть трех разных цветов: красный при закрытом порту, зелёный - при открытом, синий - в режиме *"загрузки"*.

source: There's console view at the bottom of the window. Left view is for pretty status messages and filtered AT-command results, where right view is raw COM (serial) monitor which displays all that flows through COM connection.
ru: В нижней части окна располагается консольный монитор. Левая :i:`8` часть отвечает за красивые статусные сообщения и фильтрованный вывод AT-команд, правая :i:`9` часть является монитором последовательного COM-соединения и отображает всё что попадает в COM-порт.

source: Text field :i:`8` at the bottom allows to send AT commands explicitly into modem and text field **"Search"** :i:`9` allows to search through both console windows.
ru: Текстовое поле :i:`10` в самом низу позволяет слать AT-команды модему напрямую. Текстовое поле :i:`11` осуществляет поиск по обоим консольным окнам.

source: Search does not work incrementally: it just highlights all found matches so you can see them distinctly.
ru: Поиск работает не инкрементально: он лишь подсвечивает все совпадения для удобного просмотра результатов.

source: Using queue
ru: Очередь команд

source: Whether you are using console input or automatized button which processes number of tasks, these tasks will be added into the queue of commands which you can see, pause and resume. Also you can repeat last sent (unsuccessful) command.
ru: При общении с модемом, будь то ручные команды или автоматическая кнопка настройки модема, AT-команды складываются в *"очередь"* команд. Очередь можно приостанавливать и возобнавлять, а также повторять последнюю (неудавшуюся) команду.

source: If you have **"Autofocus queue"** enabled in settings, this tab will be automatically opened when automatized sequence of commands is triggered (see :ref:`settings`).
ru: Если флажок **"Автоматически показывать очередь"** (в настройках) включен, вкладка очереди будет автоматически открыта когда автоматизированный набор команд будет запущен на исполнение (см. :ref:`settings`).

source: Here you can see list of commands that appeared after starting modem application configuration (see :ref:`configuration`). Currently working command is highlighted by green color if it is AT-command and by blue color if it is a process which uses progressbar below (XModem uploading, analog/digital inputs configuration).
ru: На скриншоте отображён список команд, появившихся после запуска конфигурирования приложения модема (см. :ref:`configuration`). Текущая работающая команда подсвечена зелёным цветом если это AT-команда, и синим цветом если это длительный процесс (загрузка прошивки по протоколу XModem, перенастройка аналоговых и цифровых входов).

source: Checkbox **"Autopause"** :i:`1` makes sure that if an error occurs when command is executed, whole queue would be paused and you will be notified of that. In most cases, this checkbox should be enabled.
ru: Флажок **"Автопауза"** :i:`1` отвечает за приостановку очереди в случае возникновения ошибок при выполнении команды. В большинстве сценариев, этот влажок должен быть активен.

source: Button **"Pause/Resume"** :i:`2` allows to manually pause/resume queue. If the queue is paused, you can still input new AT commands which will be immediately executed in second (parallel) queue which is always working in non-pausing mode for this case specially.
ru: Кнопка **"Пауза/Продолжить"** :i:`2` позволяет вручную приостановить/возобновить очередь. Если очередь приостановлена, Вы всё ещё можете посылать модему AT-команды, которые будут выполнены сразу же после ввода в параллельной (другой) очереди, работающей без остановок специально для этого применения.

source: Button **"Repeat"** :i:`3` allows to repeat last (failed) AT-command if the queue is currently paused. This command is executed in second queue, so this is just an automation around typing the same command again and again.
ru: Кнопка **"Повторить"** :i:`3` позволяет повторить последнюю (неудавшуюся) AT-команду если очередь в данный момент приостановлена. Эта команда исполняется в параллельной очереди, позволяя заменить ввод одной и той же команды вручную.

source: Progressbar :i:`4` is needed for indicating progress of long events (such as downloading firmware or configuring lots of ports).
ru: Индикатор состояния :i:`4` нужен для отображения прогресса долгих событий (таких как загрузка прошивки или перенастройка большого количества портов).

source: ModemManager settings
ru: Настройки ModemManager

source: For more comfortable look and feel you may wish to setup it for your demands. To do so, go to **"Settings"** :i:`1` tab. If you wish to skip settings chapter, go to :ref:`preparation` section.
ru: Для более комфортной работы с программой Вы можете настроить её удовлетворяющим Вас образом. Для этого перейдите на вкладку **"Настройки"** :i:`1`. Если Вы желаете пропустить часть по настройке программы, можете перейти к части :ref:`preparation`.

source: In listbox **"Application language"** :i:`2` you can choose whole application language between two languages (currently): english and russian. This localizes not only user interface, but also various status messages in console view.
ru: Выпадающий список **"Язык приложения"** :i:`2` позволяет выбрать язык всего приложения. Локализация включает не только перевод интерфейса, но также перевод всех сообщений, статусов и т. п. На текущий момент доступны два языка: английский и русский.

source: In listbox **"AT autocompletion"** :i:`3` you can select autocompletion type for manual AT-command input from 4 different types:
ru: В списке **"Автодополнение"** :i:`3` можно выбрать тип автодополнения при вводе ручных AT-команд. Всего есть 4 типа дополнения:

source: :i:`8` - None
ru: :i:`8` - Нет

source: :i:`9` - Suggest
ru: :i:`9` - Всплывающая подсказка

source: :i:`10` - Append
ru: :i:`10` - Дополнение в строке

source: :i:`11` - Suggest and append
ru: :i:`11` - Подсказка и дополнение

source: Autocompletion uses history of used AT-commands. There's no predefined list of commands.
ru: Автодополнение использует историю вводимых команд. При запуске программы список пуст, т. е. автодополнения по всем AT-командам нету.

source: Checkbox **"Autofocus queue"** :i:`4` does exactly what it promises to do: it focuses **"Queue"** tab (see :ref:`queue`) when automatized queue of commands is started, so that you can see whole queue coming and going.
ru: Флажок **"Автоматически показывать очередь"** :i:`4` делает именно то, что говорит: открывает вкладку **"Очередь"** (см. :ref:`queue`) при старте выполнения длинной очереди команд для того, чтобы Вы могли видеть что происходит в данный момент.

source: **"Colorize COM monitor"** :i:`5` checkbox improves look and feel of raw COM monitor at the bottom right side of application. It actually colorized input based on some rules, like orange for "quoted text".
ru: Флажок **"Раскраска COM-монитора"** :i:`5` улучшает вид вывода монитора последовательного порта (справа снизу) путём раскраски "синтаксиса" отдельных частей, например оранжевый - для текста в кавычках.

source: Checkbox **"Save settings on exit"** :i:`6` is needed for saving settings and state of the application between sessions. If you want to start from current setup all the time, just uncheck this checkbox and if you change any settings, they will not remain after restart.
ru: Флажок **"Сохранить настройки при выходе"** :i:`6` необходим для сохранение всевозможных статусов и установленных настроек приложения между сессиями. Если Вы хотите запретить изменение настроек, снимите эту галочку и приложение будет начинать каждый раз с теми же настройками (текущими сохранёнными).

source: The program will not save **"Save settings on exit"** option if it is unchecked. To explicitely save it you should use :s:`Ctrl` + :s:`S` shortcut to manually save current settings (see :ref:`key-shortcuts`).
ru: Программа не сохранит настройку **"Сохранять настройки при выходе"** если флажок снят. Чтобы намеренно сохранить эту настройку, используйте горячее сочетание клавиш :s:`Ctrl` :s:`S`, которое позволяет сохранять настройки в любой момент времени (см. :ref:`key-shortcuts`).

source: And finally, button **"Reset defaults"** :i:`7` resets all configurations to its default values without possibility to return :)
ru: И, наконец, кнопка **"Сбросить настройки"** :i:`7` сбрасывает все возможные настроки на их стандартные значения без возможности возврата :)

source: Preparation
ru: Подготовка к работе

source: Before using modem, you need to prepare it for work. If you obtained clean modem just from shop without our application and configuration, you need to write initial operational (OS) firmware and bootloader for it. To do this, click "Prepare empty modem" button at the lower left of the "Connection" tab. This should perform initial preparation on modem, so that you could use it properly.
ru: Перед началом использования модема, необходимо подготовить его для работы. Если у Вас есть чистый (новый) модем без нашего приложения и конфигурации, необходимо записать изначальную операционную систему и её загрузчик. Для этого нажмите кнопку "Подготовка чистого модема" в нижней левой части экрана на вкладке "Соединение". Будет произведена первоначальная подготовка модема для корректной работы.

source: You should run application from the installed folder with "Firmware" component installed, so that OS Firmware and Bootloader files (Firmware.dwl and Bootloader.dwl) is present within "Firmware" folder in the same directory where the application is located.
ru: Необходимо запускать приложение из папки с установленным компонентом "Firmware". Файлы Firmware.dwl и Bootloader.dwl (прошивка операционной системы и загрузчик) должны присутствовать в папке"Firmware" в корне директории где находится приложение.

source: This step totally rewrites OS firmware and resets default modem configuration. To reconfigure modem for your needs, do the following on the "Automatic" tab:
ru: Это действие полностью перезаписывает операционную систему и сбрасывает настройки модема. Для перенастройки модема под ваши нужды, проделайте следующие шаги на вкладке "Автоматический режим":

source: :i:`1` Remap Application & Filesystem disk space (if you need it).
ru: :i:`1` Переразбить внутреннюю память модема (место под приложение и файловую систему) если Вам это необходимо.

source: :i:`2` Configure external (internet) APN for your simcard.
ru: :i:`2` Настроить внешнюю (интернет) APN для sim-карты.

source: :i:`3` Make sure needed checkboxes is checked.
ru: :i:`3` Удостовериться, что необходимые флажки активны.

source: :i:`4` Check these if you want to update in-modem time and then refill information from modem.
ru: :i:`4` Установить этот флажок если Вы хотите обновить внутреннее время модема и обновить (получить снова) информацию о модеме после выполнения всех действий.

source: :i:`5` Finally click the **"Start"** button to get started. Then the queue (see :ref:`queue`) will be filled with needed commands and modem will proceed to setup.
ru: :i:`5` Нажать кнопку **"Начать"** для старта автоматического процесса подготовки модема. Очередь (см. :ref:`queue`) будет заполнена необходимыми командами и начнёт настройку модема.

source: If you want to update firmware (or to download it the first time), click the **"Update from cloud"** :i:`6` button. The process of updating application from the cloud is tricky though, because you will probably run into errors and will need debug skills to proceed. If you encounter any errors, please proceed to :ref:`troubleshooting` area before contacting us.
ru: Если Вы хотите обновить приложение (прошивку) (или загрузить его первый раз), нажмите кнопку **"Обновление из облака"** :i:`6`. Процесс обновления приложения из облака не до конца явный, потому как Вам вероятно придётся обходить некоторые ошибки вводом команд вручную. Если Вы обнаружите какие-либо ошибки, обратите внимание к разделу :ref:`troubleshooting`.

source: Application configuration
ru: Конфигурирование приложения модема

source: Configuring application only works if you have our application inside your modem (which is obvious).
ru: Конфигурирование (настройка) приложения (прошивки) модема работает только если эта прошивка присутствует на модеме (что очевидно).

source: :i:`1` button fills information from modem.
ru: :i:`1` - заполнить информацию из модема.

source: :i:`2` button fills information from XML config file. You can get such file with predefined settings and just load whole configuration from it.
ru: :i:`2` - заполнить информацию из XML файла. Вы можете получить XML-файл с настройками под Вашу конфигурацию и просто загрузить всю конфигурацию из него.

source: :i:`3` button saves current on-screen configuration into XML file for future use.
ru: :i:`3` - сохранить текущую конфигурацию с экрана в XML файл для дальнейшего использования.

source: :i:`4` button resets default configuration which is defined by the version of application you are using.
ru: :i:`4` - сбросить конфигурацию на стандартную (определяется версией приложения, прошитого в модеме).

source: :i:`5` button toggles all blocks for configuration. You can toggle single block by clicking on it while holding CTRL key.
ru: :i:`5` - включить/выключить конфигурирование всех блоков. Вы можете переключить статус вкл./выкл. отдельного блока путём клика по нему с зажатой клавишей CTRL.

source: Reference manual
ru: Справочное руководство

source: Primary SIM card
ru: Основная SIM-карта

source: Setup Access Point Name for primary SIM card
ru: Настройка точки доступа для основной SIM-карты

source: User
ru: Пользователь

source: Setup APN User for primary SIM card
ru: Настройка пользователя APN для основной SIM-карты

source: Password
ru: Пароль

source: Setup APN Password for primary SIM card
ru: Настройка пароля APN для основной SIM-карты

source: Secondary SIM card
ru: Дополнительная SIM-карта

source: Setup Access Point Name for secondary SIM card
ru: Настройка точки доступа для дополнительной SIM-карты

source: Setup APN User for secondary SIM card
ru: Настройка пользователя APN для дополнительной SIM-карты

source: Setup APN Password for secondary SIM card
ru: Настройка пароля APN для дополнительной SIM-карты

source: Enable
ru: Использовать

source: Check Box, allows secondary SIM card usage
ru: Флажок, включает использование дополнительной SIM-карты

source: ASDU Address
ru: Адрес ASDU

source: Application Service Data Unit address. Denotes separate segments and their addresses inside a device
ru: Адрес Application Service Data Unit. Отмечает отдельные сегменты и их адресов внутри устройства.

source: Reserved
ru: Зарезервировано

source: Maximum K
ru: Максимальный K

source: Maximum W
ru: Максимальный W

source: Baud Rate
ru: Скорость передачи

source: Setup Port Speed
ru: Настройка скорости порта

source: Data Bits
ru: Количество бит данных

source: Dropdown menu, sets Serial Frame Data Length
ru: Выпадающее меню, настраивает количество бит данных последовательного порта

source: Stop Bits
ru: Количество конечных бит

source: Dropdown menu, sets Serial Frame Stop Bits
ru: Выпадающее меню, настраивает количество стоповых бит последовательного порта

source: Parity Type
ru: Тип чётности

source: Dropdown menu, sets Serial Frame Parity Type
ru: Выпадающее меню, настраивает тип чётности последовательного порта

source: Check Box, sets usage of RTS serial flow control signal
ru: Флажок, настраивает использование RTS-сигнала

source: Check Box, sets usage of CTS serial flow control signal
ru: Флажок, настраивает использование CTS-сигнала

source: Power management
ru: Управления питанием

source: Power mode
ru: Режим управления питанием

source: Dropdown menu, sets power management mode - *none* - no power management used. - *sleep* - simple power management algorithm: power up - measure - transfer data if possible - power down - *timetable* - complex power management algorithm: calculate time table of data transfer permitted periods, independent power-ups with measure cycle, data transferring only at allowed intervals
ru: Выпадающее меню, настраивает управление питанием* *none* - управление питанием не используется* *sleep* - простой алгоритм управления питанием: включение - измерение - передача данных если возможно - выключение* *timetable* - сложный алгоритм управления питанием: Расчет временной таблицы разрешённых периодов передачи, независимые включения с циклом измерений, передача данных только в разрешённых интервалах

source: Power up interval (minutes)
ru: Интервал между включениями (минуты)

source: Used in *sleep* and *timetable* modes, sets power up intervals.
ru: Используется в режимах *sleep* и *timetable*, настраивает интервалы включения.

source: Power time table start (hours, minutes)
ru: Начало расписания (часы, минуты)

source: Used in *timetable* mode, sets start time of calculated timetable, input in two fields if 24h format.
ru: Используется в режиме *timetable*, настраивает начальное время расчётной таблицы времени, ввод в два поля при 24-часовом формате

source: Power time table interval (minutes)
ru: Интервал расписания (минуты)

source: Used in *timetable* mode, sets interval between data transfer allowed windows.
ru: Используется в режиме *timetable*, настраивает интервал между разрешёнными передачами данных

source: Power connection allowed (minutes)
ru: Время разрешённых соединений (минуты)

source: Used in *timetable* mode, sets length of data transfer allowed windows.
ru: Используется в режиме *timetable*, настраивает размер разрешённых окон передачи данных

source: PLC
ru: ПЛК

source: PLC Type
ru: Тип ПЛК

source: Drop menu, sets data source device type - *SetPoint* - connected 4..20 mA analog sensor. - *Alpha PLC* - connected with alpha-series PLC module. - *FX PLC* - connected with FX2 of FX3 series PLC module - *modbus* - connected with connected to modbus network as master Choosing options opens appropriate configuration sections below.
ru: Выпадающее меню, настраивает тип устройства источника данных - *Диктующая точка* - соединена с 4..20 мА аналоговым датчиком. - *Альфа ПЛК* - соединён с Альфа-серией ПЛК. - *FX ПЛК* - соединён с FX2 или FX3 серией модулей ПЛК - *Modbus* - соединён с modbus-сетью как мастер Выбор опций открывает подходящую конфигурационную секцию ниже.

source: PLC timers
ru: Таймеры ПЛК

source: Scan timer
ru: Таймер скана

source: Sets Data Polling period, in 0.1s units
ru: Настраивает период опроса данных, в 0.1с единицах

source: Send to UART period
ru: Период отправки в UART

source: Sets delay Between Serial Data Requests, in 0.02s units
ru: Настраивает задержку между запросами данных последовательного порта, в 0.02с единицах

source: Dimensions
ru: Размеры

source: Maxnum stations
ru: Количество станций

source: Sets number of PLC devices in network. 1 for FX PLC, 1 or 2 for Alpha PLC. Ignored in SetPoint and Modbus modes.
ru: Настраивает количество ПЛК в сети. 1 для FX, 1 или 2 для Альфа ПЛК. Игнорируется в режимах диктующей точки и Modbus.

source: Bit Registers number
ru: Кол-во битовых регистров

source: Set number of Bits, read from single FX PLC or every Alpha PLC Ignored in SetPoint and Modbus modes.
ru: Настраивает количество бит, читаемых из одного FX-ПЛК или из каждого Альфа-ПЛК. Игнорируется в режимах диктующей точки и Modbus.

source: Word Registers number
ru: Количество 16-битных регистров

source: Set number of WORD registers, read from FX PLC or every Alpha PLC Ignored in SetPoint and Modbus modes.
ru: Настраивает количество 16-битных регистров, читаемых из FX-ПЛК или из каждого Альфа-ПЛК. Игнорируется в режимах диктующей точки и Modbus.

source: External hardware watchdog timer
ru: Внешний аппаратный сторожевой таймер

source: Address
ru: Адрес

source: Setup address of special watchdog counter PLC register. Will be set as 0 every Period. Ignored in SetPoint mode.
ru: Настройка ардеса специального сторожевого счётчика в регистре ПЛК. Будет установлен в 0 в каждом периоде. Игнорируется в режиме диктующей точки.

source: Period
ru: Период

source: Setup External Hardware Watchdog reset period. Set's in second units.
ru: Настраивает период сброса внешнего аппаратного сторожевого таймера. Устанавливается в секундах.

source: Enabled
ru: Использовать

source: Check Box, setups usage of External Hardware Watchdog mechanism.
ru: Флажок, настраивает использование внешнего аппаратного сторожевого механизма.

source: FX PLC
ru: FX ПЛК

source: Read Buffer Size
ru: Размер буфера чтения

source: Setup quantity of data units, read per request. Default value is 28
ru: Настраивает количество единиц данных читаемых за запрос. Стандартное значение - 28

source: MCM read address
ru: MCM адрес чтения

source: M-registers (BIT) block start read address. Number stored in *Bit Registers number* option
ru: Стартовый адрес чтения M-регистров (БИТ)

source: MCM write address
ru: MCM адрес записи

source: M-registers (BIT) block start write address. Number stored in *Bit Registers number* option
ru: Стартовый адрес записи M-регистров (БИТ)

source: MCD read address
ru: MCD адрес чтения

source: D-registers (WORD) block start read address. Number stored in *Word Registers number* option
ru: Стартовый адрес чтения D-регистров (WORD, 16-бит)

source: D-registers (WORD) block start write address. Number stored in *Word Registers number* option
ru: Стартовый адрес записи D-регистров (WORD, 16-бит)

source: Read buffer size
ru: Размер буфера чтения

source: Configure quantity of data units per request. Deprecated.
ru: Настраивает количество единиц данных за запрос. Параметр устарел.

source: Coil Read Start Address
ru: Стартовый адрес чтения [coil]
